Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x4e2 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x86): GNU C17 12.2.0 -mtune=generic -march=pentiumpro -g -O0 -ffreestanding -fno-omit-frame-pointer
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect line string, offset: 0x1c): kernel/bootstrap/multiboot.c
    <16>   DW_AT_comp_dir    : (indirect line string, offset: 0x0): /usr/local/osdev/versions/v
    <1a>   DW_AT_low_pc      : 0x0
    <1e>   DW_AT_high_pc     : 0x968
    <22>   DW_AT_stmt_list   : 0x0
 <1><26>: Abbrev Number: 3 (DW_TAG_typedef)
    <27>   DW_AT_name        : (indirect string, offset: 0x2af): bool
    <2b>   DW_AT_decl_file   : 2
    <2c>   DW_AT_decl_line   : 17
    <2d>   DW_AT_decl_column : 15
    <2e>   DW_AT_type        : <0x32>
 <1><32>: Abbrev Number: 2 (DW_TAG_base_type)
    <33>   DW_AT_byte_size   : 1
    <34>   DW_AT_encoding    : 2	(boolean)
    <35>   DW_AT_name        : (indirect string, offset: 0x3fa): _Bool
 <1><39>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 4
    <3b>   DW_AT_encoding    : 5	(signed)
    <3c>   DW_AT_name        : (indirect string, offset: 0x191): long int
 <1><40>: Abbrev Number: 3 (DW_TAG_typedef)
    <41>   DW_AT_name        : (indirect string, offset: 0x23): size_t

 <1><76>: Abbrev Number: 2 (DW_TAG_base_type)
    <77>   DW_AT_byte_size   : 2
    <78>   DW_AT_encoding    : 7	(unsigned)
    <79>   DW_AT_name        : (indirect string, offset: 0x27c): short unsigned int
 <1><7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <7e>   DW_AT_name        : (indirect string, offset: 0x478): uint32_t
    <82>   DW_AT_decl_file   : 4
    <83>   DW_AT_decl_line   : 4
    <84>   DW_AT_decl_column : 22
    <85>   DW_AT_type        : <0x89>
 <1><89>: Abbrev Number: 2 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 7	(unsigned)
    <8c>   DW_AT_name        : (indirect string, offset: 0x217): unsigned int
 <1><90>: Abbrev Number: 2 (DW_TAG_base_type)
    <91>   DW_AT_byte_size   : 8
    <92>   DW_AT_encoding    : 7	(unsigned)
    <93>   DW_AT_name        : (indirect string, offset: 0x4c): long long unsigned int
 <1><97>: Abbrev Number: 2 (DW_TAG_base_type)
    <98>   DW_AT_byte_size   : 1
    <99>   DW_AT_encoding    : 8	(unsigned char)
    <9a>   DW_AT_name        : (indirect string, offset: 0x400): unsigned char
 <1><9e>: Abbrev Number: 2 (DW_TAG_base_type)
    <9f>   DW_AT_byte_size   : 1
    <a0>   DW_AT_encoding    : 6	(signed char)
    <a1>   DW_AT_name        : (indirect string, offset: 0x4a1): char
 <1><a5>: Abbrev Number: 21 (DW_TAG_const_type)
    <a6>   DW_AT_type        : <0x9e>
 <1><aa>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <ab>   DW_AT_name        : sys
    <af>   DW_AT_encoding    : 7	(unsigned)
    <b0>   DW_AT_byte_size   : 4
    <b1>   DW_AT_type        : <0x89>
    <b5>   DW_AT_decl_file   : 5
    <b6>   DW_AT_decl_line   : 22
    <b7>   DW_AT_decl_column : 6
    <b8>   DW_AT_sibling     : <0xed>
 <2><bc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bd>   DW_AT_name        : (indirect string, offset: 0x52c): sys_system
    <c1>   DW_AT_const_value : 0
 <2><c2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c3>   DW_AT_name        : (indirect string, offset: 0x56f): sys_kernel
    <c7>   DW_AT_const_value : 1
 <2><c8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c9>   DW_AT_name        : (indirect string, offset: 0x3d5): sys_intel8254
    <cd>   DW_AT_const_value : 2
 <2><ce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cf>   DW_AT_name        : (indirect string, offset: 0x22c): sys_memory
    <d3>   DW_AT_const_value : 3
 <2><d4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d5>   DW_AT_name        : (indirect string, offset: 0x12d): sys_pci
    <d9>   DW_AT_const_value : 4
 <2><da>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db>   DW_AT_name        : (indirect string, offset: 0x4c1): sys_interrupt
    <df>   DW_AT_const_value : 5
 <2><e0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e1>   DW_AT_name        : (indirect string, offset: 0x43a): sys_paging
    <e5>   DW_AT_const_value : 6
 <2><e6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e7>   DW_AT_name        : (indirect string, offset: 0x224): sys_elf
    <eb>   DW_AT_const_value : 7
 <2><ec>: Abbrev Number: 0
 <1><ed>: Abbrev Number: 9 (DW_TAG_array_type)
    <ee>   DW_AT_type        : <0xfd>
    <f2>   DW_AT_sibling     : <0xfd>
 <2><f6>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f7>   DW_AT_type        : <0x4c>
    <fb>   DW_AT_upper_bound : 7
 <2><fc>: Abbrev Number: 0
 <1><fd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fe>   DW_AT_byte_size   : 4
    <fe>   DW_AT_type        : <0xa5>
 <1><102>: Abbrev Number: 7 (DW_TAG_variable)
    <103>   DW_AT_name        : (indirect string, offset: 0x326): sys_text
    <107>   DW_AT_decl_file   : 5
    <108>   DW_AT_decl_line   : 33
    <109>   DW_AT_decl_column : 21
    <10a>   DW_AT_type        : <0xed>
    <10e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><114>: Abbrev Number: 9 (DW_TAG_array_type)
    <115>   DW_AT_type        : <0xfd>
    <119>   DW_AT_sibling     : <0x124>
 <2><11d>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <11e>   DW_AT_type        : <0x4c>
    <122>   DW_AT_upper_bound : 15
 <2><123>: Abbrev Number: 0
 <1><124>: Abbrev Number: 7 (DW_TAG_variable)
    <125>   DW_AT_name        : (indirect string, offset: 0x554): bit_array
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 44
    <12b>   DW_AT_decl_column : 21
    <12c>   DW_AT_type        : <0x114>
    <130>   DW_AT_location    : 5 byte block: 3 20 0 0 0 	(DW_OP_addr: 20)
 <1><136>: Abbrev Number: 3 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0x154): multiboot_uint8_t
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 97
    <13d>   DW_AT_decl_column : 25
    <13e>   DW_AT_type        : <0x97>
 <1><142>: Abbrev Number: 3 (DW_TAG_typedef)
    <143>   DW_AT_name        : (indirect string, offset: 0x69): multiboot_uint16_t
    <147>   DW_AT_decl_file   : 6
    <148>   DW_AT_decl_line   : 98
    <149>   DW_AT_decl_column : 27
    <14a>   DW_AT_type        : <0x76>
 <1><14e>: Abbrev Number: 3 (DW_TAG_typedef)
    <14f>   DW_AT_name        : (indirect string, offset: 0x3a6): multiboot_uint32_t
    <153>   DW_AT_decl_file   : 6
    <154>   DW_AT_decl_line   : 99
    <155>   DW_AT_decl_column : 25
    <156>   DW_AT_type        : <0x89>
 <1><15a>: Abbrev Number: 3 (DW_TAG_typedef)
    <15b>   DW_AT_name        : (indirect string, offset: 0x500): multiboot_uint64_t
    <15f>   DW_AT_decl_file   : 6
    <160>   DW_AT_decl_line   : 100
    <161>   DW_AT_decl_column : 29
    <162>   DW_AT_type        : <0x90>
 <1><166>: Abbrev Number: 8 (DW_TAG_structure_type)
    <167>   DW_AT_name        : (indirect string, offset: 0x25b): multiboot_aout_symbol_table
    <16b>   DW_AT_byte_size   : 16
    <16c>   DW_AT_decl_file   : 6
    <16c>   DW_AT_decl_line   : 128
    <16d>   DW_AT_decl_column : 8
    <16d>   DW_AT_sibling     : <0x1a2>
 <2><171>: Abbrev Number: 1 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x2a): tabsize
    <176>   DW_AT_decl_file   : 6
    <176>   DW_AT_decl_line   : 130
    <177>   DW_AT_decl_column : 22
    <178>   DW_AT_type        : <0x14e>
    <17c>   DW_AT_data_member_location: 0
 <2><17d>: Abbrev Number: 1 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0x44f): strsize
    <182>   DW_AT_decl_file   : 6
    <182>   DW_AT_decl_line   : 131
    <183>   DW_AT_decl_column : 22
    <184>   DW_AT_type        : <0x14e>
    <188>   DW_AT_data_member_location: 4
 <2><189>: Abbrev Number: 1 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x3e3): addr
    <18e>   DW_AT_decl_file   : 6
    <18e>   DW_AT_decl_line   : 132
    <18f>   DW_AT_decl_column : 22
    <190>   DW_AT_type        : <0x14e>
    <194>   DW_AT_data_member_location: 8
 <2><195>: Abbrev Number: 1 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x1fd): reserved
    <19a>   DW_AT_decl_file   : 6
    <19a>   DW_AT_decl_line   : 133
    <19b>   DW_AT_decl_column : 22
    <19c>   DW_AT_type        : <0x14e>
    <1a0>   DW_AT_data_member_location: 12
 <2><1a1>: Abbrev Number: 0
 <1><1a2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a3>   DW_AT_name        : (indirect string, offset: 0x2d4): multiboot_aout_symbol_table_t
    <1a7>   DW_AT_decl_file   : 6
    <1a8>   DW_AT_decl_line   : 135
    <1a9>   DW_AT_decl_column : 44
    <1aa>   DW_AT_type        : <0x166>
 <1><1ae>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1af>   DW_AT_name        : (indirect string, offset: 0x1ac): multiboot_elf_section_header_table
    <1b3>   DW_AT_byte_size   : 16
    <1b4>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 138
    <1b5>   DW_AT_decl_column : 8
    <1b5>   DW_AT_sibling     : <0x1ea>
 <2><1b9>: Abbrev Number: 11 (DW_TAG_member)
    <1ba>   DW_AT_name        : num
    <1be>   DW_AT_decl_file   : 6
    <1be>   DW_AT_decl_line   : 140
    <1bf>   DW_AT_decl_column : 22
    <1c0>   DW_AT_type        : <0x14e>
    <1c4>   DW_AT_data_member_location: 0
 <2><1c5>: Abbrev Number: 1 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x277): size
    <1ca>   DW_AT_decl_file   : 6
    <1ca>   DW_AT_decl_line   : 141
    <1cb>   DW_AT_decl_column : 22
    <1cc>   DW_AT_type        : <0x14e>
    <1d0>   DW_AT_data_member_location: 4
 <2><1d1>: Abbrev Number: 1 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x3e3): addr
    <1d6>   DW_AT_decl_file   : 6
    <1d6>   DW_AT_decl_line   : 142
    <1d7>   DW_AT_decl_column : 22
    <1d8>   DW_AT_type        : <0x14e>
    <1dc>   DW_AT_data_member_location: 8
 <2><1dd>: Abbrev Number: 1 (DW_TAG_member)
    <1de>   DW_AT_name        : (indirect string, offset: 0x63): shndx
    <1e2>   DW_AT_decl_file   : 6
    <1e2>   DW_AT_decl_line   : 143
    <1e3>   DW_AT_decl_column : 22
    <1e4>   DW_AT_type        : <0x14e>
    <1e8>   DW_AT_data_member_location: 12
 <2><1e9>: Abbrev Number: 0
 <1><1ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x32f): multiboot_elf_section_header_table_t
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 145
    <1f1>   DW_AT_decl_column : 51
    <1f2>   DW_AT_type        : <0x1ae>
 <1><1f6>: Abbrev Number: 12 (DW_TAG_union_type)
    <1f7>   DW_AT_byte_size   : 16
    <1f8>   DW_AT_decl_file   : 6
    <1f8>   DW_AT_decl_line   : 166
    <1f9>   DW_AT_decl_column : 3
    <1f9>   DW_AT_sibling     : <0x214>
 <2><1fd>: Abbrev Number: 13 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x367): aout_sym
    <202>   DW_AT_decl_file   : 6
    <202>   DW_AT_decl_line   : 168
    <203>   DW_AT_decl_column : 35
    <204>   DW_AT_type        : <0x1a2>
 <2><208>: Abbrev Number: 13 (DW_TAG_member)
    <209>   DW_AT_name        : (indirect string, offset: 0x29b): elf_sec
    <20d>   DW_AT_decl_file   : 6
    <20d>   DW_AT_decl_line   : 169
    <20e>   DW_AT_decl_column : 42
    <20f>   DW_AT_type        : <0x1ea>
 <2><213>: Abbrev Number: 0
 <1><214>: Abbrev Number: 14 (DW_TAG_structure_type)
    <215>   DW_AT_byte_size   : 8
    <216>   DW_AT_decl_file   : 6
    <216>   DW_AT_decl_line   : 208
    <217>   DW_AT_decl_column : 5
    <217>   DW_AT_sibling     : <0x234>
 <2><21b>: Abbrev Number: 1 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x2f2): framebuffer_palette_addr
    <220>   DW_AT_decl_file   : 6
    <220>   DW_AT_decl_line   : 210
    <221>   DW_AT_decl_column : 26
    <222>   DW_AT_type        : <0x14e>
    <226>   DW_AT_data_member_location: 0
 <2><227>: Abbrev Number: 1 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x387): framebuffer_palette_num_colors
    <22c>   DW_AT_decl_file   : 6
    <22c>   DW_AT_decl_line   : 211
    <22d>   DW_AT_decl_column : 26
    <22e>   DW_AT_type        : <0x142>
    <232>   DW_AT_data_member_location: 4
 <2><233>: Abbrev Number: 0
 <1><234>: Abbrev Number: 14 (DW_TAG_structure_type)
    <235>   DW_AT_byte_size   : 6
    <236>   DW_AT_decl_file   : 6
    <236>   DW_AT_decl_line   : 213
    <237>   DW_AT_decl_column : 5
    <237>   DW_AT_sibling     : <0x284>
 <2><23b>: Abbrev Number: 1 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x135): framebuffer_red_field_position
    <240>   DW_AT_decl_file   : 6
    <240>   DW_AT_decl_line   : 215
    <241>   DW_AT_decl_column : 25
    <242>   DW_AT_type        : <0x136>
    <246>   DW_AT_data_member_location: 0
 <2><247>: Abbrev Number: 1 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x177): framebuffer_red_mask_size
    <24c>   DW_AT_decl_file   : 6
    <24c>   DW_AT_decl_line   : 216
    <24d>   DW_AT_decl_column : 25
    <24e>   DW_AT_type        : <0x136>
    <252>   DW_AT_data_member_location: 1
 <2><253>: Abbrev Number: 1 (DW_TAG_member)
    <254>   DW_AT_name        : (indirect string, offset: 0x457): framebuffer_green_field_position
    <258>   DW_AT_decl_file   : 6
    <258>   DW_AT_decl_line   : 217
    <259>   DW_AT_decl_column : 25
    <25a>   DW_AT_type        : <0x136>
    <25e>   DW_AT_data_member_location: 2
 <2><25f>: Abbrev Number: 1 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x3b9): framebuffer_green_mask_size
    <264>   DW_AT_decl_file   : 6
    <264>   DW_AT_decl_line   : 218
    <265>   DW_AT_decl_column : 25
    <266>   DW_AT_type        : <0x136>
    <26a>   DW_AT_data_member_location: 3
 <2><26b>: Abbrev Number: 1 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0x2b4): framebuffer_blue_field_position
    <270>   DW_AT_decl_file   : 6
    <270>   DW_AT_decl_line   : 219
    <271>   DW_AT_decl_column : 25
    <272>   DW_AT_type        : <0x136>
    <276>   DW_AT_data_member_location: 4
 <2><277>: Abbrev Number: 1 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x4a6): framebuffer_blue_mask_size
    <27c>   DW_AT_decl_file   : 6
    <27c>   DW_AT_decl_line   : 220
    <27d>   DW_AT_decl_column : 25
    <27e>   DW_AT_type        : <0x136>
    <282>   DW_AT_data_member_location: 5
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_union_type)
    <285>   DW_AT_byte_size   : 8
    <286>   DW_AT_decl_file   : 6
    <286>   DW_AT_decl_line   : 206
    <287>   DW_AT_decl_column : 3
    <287>   DW_AT_sibling     : <0x296>
 <2><28b>: Abbrev Number: 15 (DW_TAG_member)
    <28c>   DW_AT_type        : <0x214>
 <2><290>: Abbrev Number: 15 (DW_TAG_member)
    <291>   DW_AT_type        : <0x234>
 <2><295>: Abbrev Number: 0
 <1><296>: Abbrev Number: 8 (DW_TAG_structure_type)
    <297>   DW_AT_name        : (indirect string, offset: 0x545): multiboot_info
    <29b>   DW_AT_byte_size   : 120
    <29c>   DW_AT_decl_file   : 6
    <29c>   DW_AT_decl_line   : 147
    <29d>   DW_AT_decl_column : 8
    <29d>   DW_AT_sibling     : <0x3ea>
 <2><2a1>: Abbrev Number: 1 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x513): flags
    <2a6>   DW_AT_decl_file   : 6
    <2a6>   DW_AT_decl_line   : 150
    <2a7>   DW_AT_decl_column : 22
    <2a8>   DW_AT_type        : <0x14e>
    <2ac>   DW_AT_data_member_location: 0
 <2><2ad>: Abbrev Number: 1 (DW_TAG_member)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x445): mem_lower
    <2b2>   DW_AT_decl_file   : 6
    <2b2>   DW_AT_decl_line   : 153
    <2b3>   DW_AT_decl_column : 22
    <2b4>   DW_AT_type        : <0x14e>
    <2b8>   DW_AT_data_member_location: 4
 <2><2b9>: Abbrev Number: 1 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x37d): mem_upper
    <2be>   DW_AT_decl_file   : 6
    <2be>   DW_AT_decl_line   : 154
    <2bf>   DW_AT_decl_column : 22
    <2c0>   DW_AT_type        : <0x14e>
    <2c4>   DW_AT_data_member_location: 8
 <2><2c5>: Abbrev Number: 1 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0xe4): boot_device
    <2ca>   DW_AT_decl_file   : 6
    <2ca>   DW_AT_decl_line   : 157
    <2cb>   DW_AT_decl_column : 22
    <2cc>   DW_AT_type        : <0x14e>
    <2d0>   DW_AT_data_member_location: 12
 <2><2d1>: Abbrev Number: 1 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x4cf): cmdline
    <2d6>   DW_AT_decl_file   : 6
    <2d6>   DW_AT_decl_line   : 160
    <2d7>   DW_AT_decl_column : 22
    <2d8>   DW_AT_type        : <0x14e>
    <2dc>   DW_AT_data_member_location: 16
 <2><2dd>: Abbrev Number: 1 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x1e4): mods_count
    <2e2>   DW_AT_decl_file   : 6
    <2e2>   DW_AT_decl_line   : 163
    <2e3>   DW_AT_decl_column : 22
    <2e4>   DW_AT_type        : <0x14e>
    <2e8>   DW_AT_data_member_location: 20
 <2><2e9>: Abbrev Number: 1 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x32): mods_addr
    <2ee>   DW_AT_decl_file   : 6
    <2ee>   DW_AT_decl_line   : 164
    <2ef>   DW_AT_decl_column : 22
    <2f0>   DW_AT_type        : <0x14e>
    <2f4>   DW_AT_data_member_location: 24
 <2><2f5>: Abbrev Number: 11 (DW_TAG_member)
    <2f6>   DW_AT_name        : u
    <2f8>   DW_AT_decl_file   : 6
    <2f8>   DW_AT_decl_line   : 170
    <2f9>   DW_AT_decl_column : 5
    <2fa>   DW_AT_type        : <0x1f6>
    <2fe>   DW_AT_data_member_location: 28
 <2><2ff>: Abbrev Number: 1 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x28f): mmap_length
    <304>   DW_AT_decl_file   : 6
    <304>   DW_AT_decl_line   : 173
    <305>   DW_AT_decl_column : 22
    <306>   DW_AT_type        : <0x14e>
    <30a>   DW_AT_data_member_location: 44
 <2><30b>: Abbrev Number: 1 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x7c): mmap_addr
    <310>   DW_AT_decl_file   : 6
    <310>   DW_AT_decl_line   : 174
    <311>   DW_AT_decl_column : 22
    <312>   DW_AT_type        : <0x14e>
    <316>   DW_AT_data_member_location: 48
 <2><317>: Abbrev Number: 1 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0x537): drives_length
    <31c>   DW_AT_decl_file   : 6
    <31c>   DW_AT_decl_line   : 177
    <31d>   DW_AT_decl_column : 22
    <31e>   DW_AT_type        : <0x14e>
    <322>   DW_AT_data_member_location: 52
 <2><323>: Abbrev Number: 1 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x2a3): drives_addr
    <328>   DW_AT_decl_file   : 6
    <328>   DW_AT_decl_line   : 178
    <329>   DW_AT_decl_column : 22
    <32a>   DW_AT_type        : <0x14e>
    <32e>   DW_AT_data_member_location: 56
 <2><32f>: Abbrev Number: 1 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0x370): config_table
    <334>   DW_AT_decl_file   : 6
    <334>   DW_AT_decl_line   : 181
    <335>   DW_AT_decl_column : 22
    <336>   DW_AT_type        : <0x14e>
    <33a>   DW_AT_data_member_location: 60
 <2><33b>: Abbrev Number: 1 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x166): boot_loader_name
    <340>   DW_AT_decl_file   : 6
    <340>   DW_AT_decl_line   : 184
    <341>   DW_AT_decl_column : 22
    <342>   DW_AT_type        : <0x14e>
    <346>   DW_AT_data_member_location: 64
 <2><347>: Abbrev Number: 1 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0x354): apm_table
    <34c>   DW_AT_decl_file   : 6
    <34c>   DW_AT_decl_line   : 187
    <34d>   DW_AT_decl_column : 22
    <34e>   DW_AT_type        : <0x14e>
    <352>   DW_AT_data_member_location: 68
 <2><353>: Abbrev Number: 1 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0x0): vbe_control_info
    <358>   DW_AT_decl_file   : 6
    <358>   DW_AT_decl_line   : 190
    <359>   DW_AT_decl_column : 22
    <35a>   DW_AT_type        : <0x14e>
    <35e>   DW_AT_data_member_location: 72
 <2><35f>: Abbrev Number: 1 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0x1ef): vbe_mode_info
    <364>   DW_AT_decl_file   : 6
    <364>   DW_AT_decl_line   : 191
    <365>   DW_AT_decl_column : 22
    <366>   DW_AT_type        : <0x14e>
    <36a>   DW_AT_data_member_location: 76
 <2><36b>: Abbrev Number: 1 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0x35e): vbe_mode
    <370>   DW_AT_decl_file   : 6
    <370>   DW_AT_decl_line   : 192
    <371>   DW_AT_decl_column : 22
    <372>   DW_AT_type        : <0x142>
    <376>   DW_AT_data_member_location: 80
 <2><377>: Abbrev Number: 1 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x249): vbe_interface_seg
    <37c>   DW_AT_decl_file   : 6
    <37c>   DW_AT_decl_line   : 193
    <37d>   DW_AT_decl_column : 22
    <37e>   DW_AT_type        : <0x142>
    <382>   DW_AT_data_member_location: 82
 <2><383>: Abbrev Number: 1 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0x19a): vbe_interface_off
    <388>   DW_AT_decl_file   : 6
    <388>   DW_AT_decl_line   : 194
    <389>   DW_AT_decl_column : 22
    <38a>   DW_AT_type        : <0x142>
    <38e>   DW_AT_data_member_location: 84
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x3e8): vbe_interface_len
    <394>   DW_AT_decl_file   : 6
    <394>   DW_AT_decl_line   : 195
    <395>   DW_AT_decl_column : 22
    <396>   DW_AT_type        : <0x142>
    <39a>   DW_AT_data_member_location: 86
 <2><39b>: Abbrev Number: 1 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x55e): framebuffer_addr
    <3a0>   DW_AT_decl_file   : 6
    <3a0>   DW_AT_decl_line   : 197
    <3a1>   DW_AT_decl_column : 22
    <3a2>   DW_AT_type        : <0x15a>
    <3a6>   DW_AT_data_member_location: 88
 <2><3a7>: Abbrev Number: 1 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x314): framebuffer_pitch
    <3ac>   DW_AT_decl_file   : 6
    <3ac>   DW_AT_decl_line   : 198
    <3ad>   DW_AT_decl_column : 22
    <3ae>   DW_AT_type        : <0x14e>
    <3b2>   DW_AT_data_member_location: 96
 <2><3b3>: Abbrev Number: 1 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x11): framebuffer_width
    <3b8>   DW_AT_decl_file   : 6
    <3b8>   DW_AT_decl_line   : 199
    <3b9>   DW_AT_decl_column : 22
    <3ba>   DW_AT_type        : <0x14e>
    <3be>   DW_AT_data_member_location: 100
 <2><3bf>: Abbrev Number: 1 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x519): framebuffer_height
    <3c4>   DW_AT_decl_file   : 6
    <3c4>   DW_AT_decl_line   : 200
    <3c5>   DW_AT_decl_column : 22
    <3c6>   DW_AT_type        : <0x14e>
    <3ca>   DW_AT_data_member_location: 104
 <2><3cb>: Abbrev Number: 1 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x3c): framebuffer_bpp
    <3d0>   DW_AT_decl_file   : 6
    <3d0>   DW_AT_decl_line   : 201
    <3d1>   DW_AT_decl_column : 21
    <3d2>   DW_AT_type        : <0x136>
    <3d6>   DW_AT_data_member_location: 108
 <2><3d7>: Abbrev Number: 1 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x40e): framebuffer_type
    <3dc>   DW_AT_decl_file   : 6
    <3dc>   DW_AT_decl_line   : 205
    <3dd>   DW_AT_decl_column : 21
    <3de>   DW_AT_type        : <0x136>
    <3e2>   DW_AT_data_member_location: 109
 <2><3e3>: Abbrev Number: 23 (DW_TAG_member)
    <3e4>   DW_AT_type        : <0x284>
    <3e8>   DW_AT_data_member_location: 112
 <2><3e9>: Abbrev Number: 0
 <1><3ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x206): multiboot_info_t
    <3ef>   DW_AT_decl_file   : 6
    <3f0>   DW_AT_decl_line   : 224
    <3f1>   DW_AT_decl_column : 31
    <3f2>   DW_AT_type        : <0x296>
 <1><3f6>: Abbrev Number: 16 (DW_TAG_variable)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x4e7): multiboot_header
    <3fb>   DW_AT_decl_file   : 1
    <3fb>   DW_AT_decl_line   : 5
    <3fc>   DW_AT_decl_column : 18
    <3fd>   DW_AT_type        : <0x3ea>
    <401>   DW_AT_external    : 1
    <401>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><407>: Abbrev Number: 16 (DW_TAG_variable)
    <408>   DW_AT_name        : (indirect string, offset: 0x4de): mb_magic
    <40c>   DW_AT_decl_file   : 1
    <40c>   DW_AT_decl_line   : 6
    <40d>   DW_AT_decl_column : 15
    <40e>   DW_AT_type        : <0x4c>
    <412>   DW_AT_external    : 1
    <412>   DW_AT_location    : 5 byte block: 3 78 0 0 0 	(DW_OP_addr: 78)
 <1><418>: Abbrev Number: 17 (DW_TAG_subprogram)
    <419>   DW_AT_external    : 1
    <419>   DW_AT_name        : (indirect string, offset: 0x4f8): printf_
    <41d>   DW_AT_decl_file   : 7
    <41e>   DW_AT_decl_line   : 61
    <41f>   DW_AT_decl_column : 5
    <420>   DW_AT_prototyped  : 1
    <420>   DW_AT_type        : <0x61>
    <424>   DW_AT_declaration : 1
    <424>   DW_AT_sibling     : <0x42f>
 <2><428>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <429>   DW_AT_type        : <0xfd>
 <2><42d>: Abbrev Number: 24 (DW_TAG_unspecified_parameters)
 <2><42e>: Abbrev Number: 0
 <1><42f>: Abbrev Number: 25 (DW_TAG_subprogram)
    <430>   DW_AT_external    : 1
    <430>   DW_AT_name        : (indirect string, offset: 0x41f): set_debug_output
    <434>   DW_AT_decl_file   : 9
    <435>   DW_AT_decl_line   : 28
    <436>   DW_AT_decl_column : 6
    <437>   DW_AT_prototyped  : 1
    <437>   DW_AT_declaration : 1
    <437>   DW_AT_sibling     : <0x441>
 <2><43b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <43c>   DW_AT_type        : <0x26>
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 17 (DW_TAG_subprogram)
    <442>   DW_AT_external    : 1
    <442>   DW_AT_name        : (indirect string, offset: 0x4d7): memcpy
    <446>   DW_AT_decl_file   : 8
    <447>   DW_AT_decl_line   : 62
    <448>   DW_AT_decl_column : 7
    <449>   DW_AT_prototyped  : 1
    <449>   DW_AT_type        : <0x461>
    <44d>   DW_AT_declaration : 1
    <44d>   DW_AT_sibling     : <0x461>
 <2><451>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <452>   DW_AT_type        : <0x463>
 <2><456>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <457>   DW_AT_type        : <0x46d>
 <2><45b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <45c>   DW_AT_type        : <0x40>
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <462>   DW_AT_byte_size   : 4
 <1><463>: Abbrev Number: 18 (DW_TAG_restrict_type)
    <464>   DW_AT_type        : <0x461>
 <1><468>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <469>   DW_AT_byte_size   : 4
    <469>   DW_AT_type        : <0x472>
 <1><46d>: Abbrev Number: 18 (DW_TAG_restrict_type)
    <46e>   DW_AT_type        : <0x468>
 <1><472>: Abbrev Number: 27 (DW_TAG_const_type)
 <1><473>: Abbrev Number: 28 (DW_TAG_subprogram)
    <474>   DW_AT_external    : 1
    <474>   DW_AT_name        : (indirect string, offset: 0x10a): multiboot_echo_to_serial
    <478>   DW_AT_decl_file   : 1
    <479>   DW_AT_decl_line   : 27
    <47a>   DW_AT_decl_column : 6
    <47b>   DW_AT_prototyped  : 1
    <47b>   DW_AT_low_pc      : 0x8a
    <47f>   DW_AT_high_pc     : 0x8de
    <483>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <485>   DW_AT_call_all_tail_calls: 1
    <485>   DW_AT_sibling     : <0x499>
 <2><489>: Abbrev Number: 7 (DW_TAG_variable)
    <48a>   DW_AT_name        : (indirect string, offset: 0x30b): mb_flags
